Teknikio/Adafruit_nRF52_Arduino/variants/teknikio_bluebird/variant.h
/*
 Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
 Copyright (c) 2016 Sandeep Mistry All right reserved.
 Copyright (c) 2018, Adafruit Industries (adafruit.com)

 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.
 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 See the GNU Lesser General Public License for more details.
 You should have received a copy of the GNU Lesser General Public
 License along with this library; if not, write to the Free Software
 Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_BLUEBIRD_
#define _VARIANT_BLUEBIRD_

/** Master clock frequency */
#define VARIANT_MCK       (64000000ul)

#define USE_LFXO      // Board uses 32khz crystal for LF
//#define USE_LFRC    // Board uses RC for LF

/*----------------------------------------------------------------------------
*        Headers
*----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

// Number of pins defined in PinDescription array
#define PINS_COUNT           (48)
#define NUM_DIGITAL_PINS     (48)
#define NUM_ANALOG_INPUTS    (8)
#define NUM_ANALOG_OUTPUTS   (0)

// LEDs
#define PIN_NEOPIXEL         (47)

#define LED_BUILTIN          (25)
#define LED_STATE_ON         1         // State when LED is litted

/*
* Analog pins
*/
#define PIN_A0               (2)
#define PIN_A1               (3)
#define PIN_A2               (4)
#define PIN_A3               (5)
#define PIN_A4               (28)
#define PIN_A5               (29)
#define PIN_A6               (30)
#define PIN_A7               (31)


static const uint8_t A0  = PIN_A0 ;
static const uint8_t A1  = PIN_A1 ;
static const uint8_t A2  = PIN_A2 ;
static const uint8_t A3  = PIN_A3 ;
static const uint8_t A4  = PIN_A4 ;
static const uint8_t A5  = PIN_A5 ;
static const uint8_t A6  = PIN_A6 ;
static const uint8_t A7  = PIN_A7 ;

#define ADC_RESOLUTION    14


/*
* Serial interfaces
*/
// Serial
#define PIN_SERIAL1_RX       (7)
#define PIN_SERIAL1_TX       (8)

/*
* Wire Interfaces
*/
#define WIRE_INTERFACES_COUNT 1

#define LED_BUILTIN          PIN_A8
#define LED_CONN             PIN_A9
#define LED_RED              PIN_A8
#define LED_BLUE             PIN_A9

//Board terminals - calling
#define BLUEBIRD_IO1        PIN_A5
#define BLUEBIRD_IO2        PIN_A7
#define BLUEBIRD_IO3        PIN_A0
#define BLUEBIRD_IO4        PIN_A1

#define PIN_WIRE_SDA        (44)
#define PIN_WIRE_SCL        (43)
#define PIN_WIRE_INT		(45)

#define PIN_BUZZER      	(46)

#define PIN_COLOR_ENABLE    (30)

#define USB_MSC_BLOCK_SIZE    512
#define USB_MSC_BLOCK_COUNT   ((2*1024*1024) / USB_MSC_BLOCK_SIZE)

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
*        Arduino objects - C++ only
*----------------------------------------------------------------------------*/

#endif
